<?php
    // Заданные значения
    $x = 2;
    $y = 6;
    $z = 9;

    // Вычисление выражения (x+1)^4 - 2(z - 2x^2 + y^2)
    $result = pow($x + 1, 4) - 2 * ($z - 2 * pow($x, 2) + pow($y, 2));

    // Вывод результата
    echo "Результат выражения: $result<br>";


// Заданные значения
    $a = 4;
    $b = 8;
    $c = 3;

// Всевозможные результаты деления
    $result1 = isset($a, $b, $c) ? ($a + $b) / $c : "Не все переменные определены";
    $result2 = isset($a, $b, $c) ? ($a + $c) / $b : "Не все переменные определены";
    $result3 = isset($a, $b, $c) ? ($b + $c) / $a : "Не все переменные определены";

// Вывод результатов
    echo "Результат 1: $result1<br>";
    echo "Результат 2: $result2<br>";
    echo "Результат 3: $result3<br>";


// Заданные значения
    $number1 = 17;
    $number2 = 54;

// Вычисление суммы 40% от первого числа и 84% от второго числа
    $sum = 0.4 * $number1 + 0.84 * $number2;

// Вывод результата
    echo "Сумма: $sum <br>";


// Заданное трехзначное число
    $number = 456;

// Разбиение числа на цифры
    $digit1 = floor($number / 100); // Получаем первую цифру
    $digit2 = floor(($number % 100) / 10); // Получаем вторую цифру
    $digit3 = $number % 10; // Получаем третью цифру

// Вычисление суммы цифр
    $sum = $digit1 + $digit2 + $digit3;

// Вывод результата
    echo "Сумма цифр числа $number: $sum<br>";


// Заданное число
    $number = 0;

// Условный оператор
    if ($number > 10) {
        // Если число больше 10, увеличиваем на 100
        $result = $number + 100;
    } else {
        // Иначе (если число не больше 10), уменьшаем на 30
        $result = $number - 30;
    }

// Вывод результата
    echo "Результат: $result<br>";







